# Ensures all applications to be installed to the ~/Applications directory.
cask_args appdir: "~/Applications"

# Software
brew "atuin"
brew "bat"
brew "binutils"
brew "oven-sh/bun/bun"
brew "cask"
brew "clang-format"
brew "ccache"
brew "cmake"
brew "coreutils"  # Update the outdated default macOS ones
brew "delve"
brew "dive"
brew "homeport/tap/dyff"
brew "elixir"
brew "etcd"
brew "fd"
brew "findutils"
brew "fzf"
brew "gettext"
brew "git"
brew "gnuplot"
brew "go"
brew "graphviz"
brew "grep"
brew "gron"
brew "httpie"
brew "htop"
brew "hugo"
brew "jless"
brew "jq"
brew "kind"
brew "kubectl"
brew "kubectx"
brew "kubelogin"
brew "libtool"
brew "llvm"
brew "lld"
brew "lua-language-server"
brew "luarocks"
brew "mas"  # Mac App Store manager
brew "nasm"
brew "nim"
brew "ninja"
brew "node"
brew "mdcurran/taps/note"
brew "nats-io/nats-tools/nats"
brew "nats-server"
brew "neovim"
brew "odin"
brew "openjdk"
brew "orbstack"
brew "pass"
brew "pdm"
brew "perl"
brew "postgresql"
brew "protobuf"
brew "pyenv"
brew "rbenv"
brew "rclone"
brew "redis"
brew "ripgrep"
brew "ruby-build"
brew "sbcl"
brew "shellcheck"
brew "sqlc"
brew "starship"
brew "stern"
brew "terraform"
brew "viddy"
brew "vim"
brew "yarn"
brew "yq"
brew "zig"

# Applications
cask "adobe-digital-editions"
cask "clickhouse"
cask "cursor"
cask "dash"
cask "discord"
cask "flux"  # f.lux
cask "firefox"
cask "ghostty"
cask "insomnia"
cask "mullvad-vpn"
cask "ngrok"
cask "notion"
cask "obsidian"
cask "rar"
cask "signal"
cask "spotify"
cask "steam"
cask "visual-studio-code"
cask "wezterm"
cask "zoom"

# Fonts
cask "font-jetbrains-mono"

# Mac App Store
mas "Magnet", id: 441258766
mas "Tailscale", id: 1475387142
mas "Things 3", id: 904280696
